<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Created with Recipe Robot v0.1.0 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of MMD-QuickLook.</string>
	<key>Identifier</key>
	<string>com.github.sheagcraig.download.MMD-QuickLook</string>
	<key>Input</key>
	<dict>
		<key>GITHUB_REPO</key>
		<string>ttscoff/MMD-QuickLook</string>
		<key>NAME</key>
		<string>MMD-QuickLook</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.5.0</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>DeprecationWarning</string>
			<key>Arguments</key>
			<dict>
				<key>warning_message</key>
				<string>The sheagcraig-recipes repository is deprecated.
Details: https://github.com/autopkg/sheagcraig-recipes/issues/71

Copies of these recipes have been created in the homebysix-recipes repo:
- MMD-QuickLook.download
- MMD-QuickLook.install
- MMD-QuickLook.munki
				</string>
			</dict>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>github_repo</key>
				<string>%GITHUB_REPO%</string>
			</dict>
			<key>Processor</key>
			<string>GitHubReleasesInfoProvider</string>
		</dict>
		<dict>
			<key>Arguments</key>
			<dict>
				<key>filename</key>
				<string>%NAME%-%version%.zip</string>
			</dict>
			<key>Processor</key>
			<string>URLDownloader</string>
		</dict>
		<dict>
			<key>Processor</key>
			<string>EndOfCheckPhase</string>
		</dict>
	</array>
</dict>
</plist>
