<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of Greenfoot</string>
    <key>Identifier</key>
    <string>com.github.sheagcraig.download.Greenfoot</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Greenfoot</string>
    </dict>
    <key>MinimumVersion</key>
    <string>1.1</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>DeprecationWarning</string>
            <key>Arguments</key>
            <dict>
                <key>warning_message</key>
                <string>The sheagcraig-recipes repository is deprecated.
Details: https://github.com/autopkg/sheagcraig-recipes/issues/71

Copies of these recipes have been created in the homebysix-recipes repo:
- Greenfoot.download
- Greenfoot.pkg
                </string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://www.greenfoot.org/download</string>
                <key>re_pattern</key>
                <string>https://www.greenfoot.org/download/files/Greenfoot-mac-[\S]+.zip</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%match%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
