<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of Eclipse.</string>
    <key>Identifier</key>
    <string>com.github.sheagcraig.download.Eclipse</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>Eclipse</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://eclipse.org/downloads/</string>
                <!-- Example: https://eclipse.org/downloads/download.php?file=/technology/epp/downloads/release/mars/1/eclipse-jee-mars-1-macosx-cocoa-x86_64.tar.gz -->
                <!-- https://eclipse.org/downloads/download.php?file=/technology/epp/downloads/release/mars/1/eclipse-java-mars-1-macosx-cocoa-x86_64.tar.gz -->
                <!--    href="download\.php\?file=([/\w\d]*/eclipse-java-\w+-\d+-macosx-cocoa-x86_64\.tar\.gz)" title="Download"&gt;64 bit&lt;/a&gt;.*$</string> -->
                <!--    href="download .php ?file=/technology/epp/downloads/release/mars/1/eclipse-java-mars-1-macosx-cocoa-x86_64.tar.gz" title="Download">64 bit</a> -->
                <key>re_pattern</key>
                <string>href="download\.php\?file=([/\w]+eclipse-java[\w-]+macosx-cocoa-x86_64\.tar\.gz)"</string>
                <key>result_output_var_name</key>
                <string>match</string>
                <key>request_headers</key>
                <dict>
                    <key>user-agent</key>
                    <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_11) AppleWebKit/601.1.39 (KHTML, like Gecko) Version/9.0 Safari/601.1.39</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://eclipse.org/downloads/download.php?r=1&amp;file=%match%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>