<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Generated by Recipe Robot v0.0.3 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Learning Ally Link from the Mac App Store and creates a package.</string>
	<key>Identifier</key>
	<string>com.github.sheagcraig.pkg.LearningAllyLink</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Learning Ally Link</string>
		<key>PATH</key>
		<string>/Applications/Learning Ally Link.app</string>
	</dict>
	<key>MinimumVersion</key>
    <string>1.1</string>
	<key>ParentRecipe</key>
	<string>com.github.nmcspadden.pkg.appstore</string>
	<key>Process</key>
	<array>
		<dict>
			<key>Processor</key>
			<string>DeprecationWarning</string>
			<key>Arguments</key>
			<dict>
				<key>warning_message</key>
				<string>The sheagcraig-recipes repository is deprecated.
Details: https://github.com/autopkg/sheagcraig-recipes/issues/71

This LearningAllyLink recipe will be deleted in the future.
				</string>
			</dict>
		</dict>
	</array>
</dict>
</plist>
