<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
	<key>Comment</key>
	<string>Generated by Recipe Robot v0.0.3 (https://github.com/homebysix/recipe-robot)</string>
	<key>Description</key>
	<string>Downloads the latest version of Learning Ally Link from the Mac App Store and creates a package.</string>
	<key>Identifier</key>
	<string>com.github.sheagcraig.pkg.LearningAllyLink</string>
	<key>Input</key>
	<dict>
		<key>NAME</key>
		<string>Learning Ally Link</string>
		<key>PATH</key>
		<string>/Applications/Learning Ally Link.app</string>
	</dict>
	<key>MinimumVersion</key>
	<string>0.5.0</string>
	<key>ParentRecipe</key>
	<string>com.github.nmcspadden.pkg.appstore</string>
	<key>Process</key>
	<array/>
</dict>
</plist>
