<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads latest version of MinecraftEdu.  Be sure to replace your username and password.  If you do not want to put your password in plaintext, you can use a hash of it generated here: http://minecraftedu.com/api/api.php?action=gethash&amp;username=yourusername&amp;password=yourpassword</string>
    <key>Identifier</key>
    <string>com.github.sheagcraig.download.MinecraftEdu</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>minecraft</string>
        <key>HASHED</key>
        <string>true</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>username</key>
                <string>%USERNAME%</string>
                <key>password</key>
                <string>%PASSWORD%</string>
            </dict>
            <key>Processor</key>
            <string>MinecraftEduURLProvider</string>
		</dict>
        <dict>
            <key>Arguments</key>
            <dict>
                <key>filename</key>
                <string>%NAME%.jar</string>
            </dict>
            <key>Processor</key>
            <string>URLDownloader</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
