<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Package the current Git commit of the git-hosted version of cowsay.</string>
    <key>Identifier</key>
    <string>com.github.sheagcraig.pkg.cowsay</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>cowsay</string>
        <key>COWSAY_URL</key>
        <string>https://github.com/schacon/cowsay/zipball/master</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>ParentRecipe</key>
    <string>com.github.sheagcraig.download.cowsay</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Comment</key>
            <string>Create a pkg root; we'll extract things from the disk image here.</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/cowsay_root</string>
                <key>pkgdirs</key>
                <dict>
                    <key>usr</key>
                    <string>0755</string>
                    <key>usr/local</key>
                    <string>0755</string>
                    <key>usr/local/bin</key>
                    <string>0755</string>
                    <key>usr/local/share</key>
                    <string>0755</string>
                    <key>usr/local/share/cows</key>
                    <string>0755</string>
                    <key>usr/local/share/man</key>
                    <string>0755</string>
                    <key>usr/local/share/man/man1</key>
                    <string>0755</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Comment</key>
            <string>Copy cowsay to bin folder.</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%cowsay_path%/cowsay</string>
                <key>destination_path</key>
                <string>%pkgroot%/usr/local/bin</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Comment</key>
            <string>Copy cows.</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%cowsay_path%/cows</string>
                <key>destination_path</key>
                <string>%pkgroot%/usr/local/share/cows</string>
                <key>overwrite</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgInfoCreator</string>
            <key>Comment</key>
            <string>Make PackageInfo file for our package</string>
            <key>Arguments</key>
            <dict>
                <key>version</key>
                <string>%version%</string>
                <key>template_path</key>
                <string>PackageInfoTemplate</string>
                <key>infofile</key>
                <string>%RECIPE_CACHE_DIR%/PackageInfo</string>
                <key>pkgtype</key>
                <string>flat</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Comment</key>
            <string>Copy manfile.</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%cowsay_path%/cowsay.1</string>
                <key>destination_path</key>
                <string>%pkgroot%/usr/local/share/man/man1/cowsay.1</string>
                <key>overwrite</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Comment</key>
            <string>Build the package</string>
            <key>Arguments</key>
            <dict>
                <key>pkg_request</key>
                <dict>
                    <key>pkgname</key>
                    <string>%NAME%-%version%</string>
                    <key>pkgdir</key>
                    <string>%RECIPE_CACHE_DIR%</string>
                    <key>id</key>
                    <string>com.github.sheagcraig.cowsay</string>
                    <key>infofile</key>
                    <string>%RECIPE_CACHE_DIR%/PackageInfo</string>
                    <key>options</key>
                    <string>purge_ds_store</string>
                    <key>chown</key>
                    <array>
                        <dict>
                            <key>path</key>
                            <string>usr</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>wheel</string>
                        </dict>
                    </array>
                </dict>
            </dict>
        </dict>
    </array>
</dict>
</plist>
