<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Package the current Git commit of Shea Craig's:jss-autopkg-addon</string>
    <key>Identifier</key>
    <string>com.github.sheagcraig.pkg.jss-autopkg-addon</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>jss-autopkg-addon</string>
        <key>JSSIMPORTER_URL</key>
        <string>https://github.com/sheagcraig/jss-autopkg-addon/zipball/master</string>
        <key>PYTHON_JSS_URL</key>
		<string>https://pypi.python.org/pypi/python-jss</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Comment</key>
            <string>Find the latest python-jss egg.</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%PYTHON_JSS_URL%</string>
                <key>re_pattern</key>
				<string>https.*?\.egg</string>
				<!--Example line: <a href="https://pypi.python.org/packages/2.7/p/python-jss/python_jss-0.4.2-py2.7.egg#md5=45113a1f7604b43b08ec3b74b918e312">python_jss-0.4.2-py2.7.egg</a> -->
				<key>result_output_var_name</key>
				<string>latest_python_jss</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Comment</key>
            <string>Download latest python-jss to site-packages for postinstall script easy_install.</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%latest_python_jss%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Comment</key>
            <string>Download latest jss-autopkg-addon zip archive</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%JSSIMPORTER_URL%</string>
                <key>filename</key>
                <string>%NAME%.zip</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Unarchiver</string>
            <key>Arguments</key>
            <dict>
                <key>archive_path</key>
                <string>%pathname%</string>
                <key>destination_path</key>
                <string>%RECIPE_CACHE_DIR%/source</string>
                <key>purge_destination</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>JSSAutoPkgAddonSourceFinder</string>
            <key>Arguments</key>
            <dict>
                <key>input_path</key>
                <string>%destination_path%</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Versioner</string>
            <key>Comment</key>
            <string>Extract a version string from version.plist to use for the package.</string>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
                <string>%jss_autopkg_addon_path%/version.plist</string>
                <key>plist_version_key</key>
                <string>Version</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgRootCreator</string>
            <key>Comment</key>
            <string>Create a pkg root; we'll extract things from the disk image here.</string>
            <key>Arguments</key>
            <dict>
                <key>pkgroot</key>
                <string>%RECIPE_CACHE_DIR%/jss_autopkg_addon_root</string>
                <key>pkgdirs</key>
                <dict>
                    <key>Library</key>
                    <string>01755</string>
                    <key>Library/AutoPkg</key>
                    <string>0755</string>
                    <key>Library/AutoPkg/autopkglib</key>
                    <string>0755</string>
					<key>usr</key>
                    <string>0755</string>
					<key>usr/share</key>
                    <string>0755</string>
					<key>usr/share/jss-autopkg-addon</key>
                    <string>0755</string>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Comment</key>
            <string>Copy python-jss to package site-packages.</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
				<string>%RECIPE_CACHE_DIR%/downloads/python_jss*.egg</string>
                <key>destination_path</key>
				<string>%pkgroot%/usr/share/</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Comment</key>
            <string>Copy JSSImporter.py to /Library/AutoPkg</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%jss_autopkg_addon_path%/JSSImporter.py</string>
                <key>destination_path</key>
                <string>%pkgroot%/Library/AutoPkg/autopkglib/JSSImporter.py</string>
                <key>overwrite</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Comment</key>
            <string>Copy example templates to documentation folder</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%jss_autopkg_addon_path%/example_templates</string>
                <key>destination_path</key>
				<string>%pkgroot%/usr/share/jss-autopkg-addon/</string>
                <key>overwrite</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Comment</key>
            <string>Copy README to documentation folder</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
                <string>%jss_autopkg_addon_path%/README.md</string>
                <key>destination_path</key>
				<string>%pkgroot%/usr/share/jss-autopkg-addon/README.md</string>
                <key>overwrite</key>
                <true/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgInfoCreator</string>
            <key>Comment</key>
            <string>Make PackageInfo file for our package</string>
            <key>Arguments</key>
            <dict>
                <key>version</key>
                <string>%version%</string>
                <key>template_path</key>
                <string>PackageInfoTemplate</string>
                <key>infofile</key>
                <string>%RECIPE_CACHE_DIR%/PackageInfo</string>
                <key>pkgtype</key>
                <string>flat</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PkgCreator</string>
            <key>Comment</key>
            <string>Build the package</string>
            <key>Arguments</key>
            <dict>
                <key>pkgname</key>
                <string>%NAME%-%version%</string>
                <key>pkg_request</key>
                <dict>
                    <key>pkgdir</key>
                    <string>%RECIPE_CACHE_DIR%</string>
                    <key>id</key>
                    <string>com.github.sheagcraig.jss-autopkg-addon</string>
                    <key>infofile</key>
                    <string>%RECIPE_CACHE_DIR%/PackageInfo</string>
                    <key>options</key>
                    <string>purge_ds_store</string>
					<key>scripts</key>
					<string>%RECIPE_DIR%/scripts</string>
                    <key>chown</key>
                    <array>
                        <dict>
                            <key>path</key>
                            <string>Library</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>wheel</string>
                        </dict>
                        <dict>
                            <key>path</key>
							<string>Library/AutoPkg/autopkglib/JSSImporter.py</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>wheel</string>
                            <key>mode</key>
                            <string>0755</string>
                        </dict>
                        <dict>
                            <key>path</key>
							<string>usr</string>
                            <key>user</key>
                            <string>root</string>
                            <key>group</key>
                            <string>wheel</string>
                        </dict>
                    </array>
                </dict>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>FileFinder</string>
            <key>Comment</key>
            <string>Find the egg filename for deletion.</string>
            <key>Arguments</key>
            <dict>
				<key>pattern</key>
				<string>%RECIPE_CACHE_DIR%/downloads/python_jss*.egg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>PathDeleter</string>
            <key>Comment</key>
            <string>Remove the python-jss egg so it doesn't glob into the next update.</string>
            <key>Arguments</key>
            <dict>
				<key>path_list</key>
				<array>
					<string>%found_filename%</string>
				</array>
            </dict>
        </dict>
    </array>
</dict>
</plist>
