<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of OpenEmu.</string>
    <key>Identifier</key>
    <string>com.github.sheagcraig.download.OpenEmu</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>OpenEmu</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>http://openemu.org</string>
                <key>re_pattern</key>
                <string>https://github\.com/OpenEmu/OpenEmu/releases/download/v[0-9.]+/OpenEmu_[0-9.]+\.zip</string>
                <!-- Example: "https://github.com/OpenEmu/OpenEmu/releases/download/v1.0.4/OpenEmu_1.0.4.zip" -->
                <key>result_output_var_name</key>
                <string>match</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%match%</string>
                <key>filename</key>
                <string>OpenEmu.zip</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
