<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Download the current built package of yo.</string>
    <key>Identifier</key>
    <string>com.github.sheagcraig.download.yo</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>yo</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.5.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>DeprecationWarning</string>
            <key>Arguments</key>
            <dict>
                <key>warning_message</key>
                <string>The sheagcraig-recipes repository is deprecated.
Details: https://github.com/autopkg/sheagcraig-recipes/issues/71

Copies of these recipes have been created in the homebysix-recipes repo:
- yo.download
                </string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>GitHubReleasesInfoProvider</string>
            <key>Comment</key>
            <string>Get the latest release package.</string>
            <key>Arguments</key>
            <dict>
                <key>github_repo</key>
                <string>sheagcraig/yo</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Comment</key>
            <string>Download latest yo package.</string>
            <key>Arguments</key>
            <dict />
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
