<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
	<string>Downloads the latest version of NetHack and makes a pkg of it.</string>
    <key>Identifier</key>
    <string>com.github.sheagcraig.pkg.NetHack</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>NetHack</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.2.9</string>
    <key>ParentRecipe</key>
	<string>com.github.sheagcraig.download.NetHack</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
				<string>%pathname%/*.pkg</string>
                <key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/unpacked/NetHack.pkg</string>
				<key>overwrite</key>
				<true/>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Versioner</string>
            <key>Arguments</key>
            <dict>
                <key>input_plist_path</key>
				<string>%RECIPE_CACHE_DIR%/unpacked/NetHack.pkg/Contents/Info.plist</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>Copier</string>
            <key>Arguments</key>
            <dict>
                <key>source_path</key>
				<string>%RECIPE_CACHE_DIR%/unpacked/NetHack.pkg</string>
                <key>destination_path</key>
				<string>%RECIPE_CACHE_DIR%/%NAME%-%version%.pkg</string>
            </dict>
        </dict>
    </array>
</dict>
</plist>
