<?xml version="1.0" encoding="UTF-8"?>
<!DOCTYPE plist PUBLIC "-//Apple//DTD PLIST 1.0//EN" "http://www.apple.com/DTDs/PropertyList-1.0.dtd">
<plist version="1.0">
<dict>
    <key>Description</key>
    <string>Downloads the current release version of Vivaldi.</string>
    <key>Identifier</key>
    <string>com.github.sheagcraig.download.Vivaldi</string>
    <key>Input</key>
    <dict>
        <key>NAME</key>
        <string>OpenEmu</string>
    </dict>
    <key>MinimumVersion</key>
    <string>0.4.0</string>
    <key>Process</key>
    <array>
        <dict>
            <key>Processor</key>
            <string>URLTextSearcher</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>https://vivaldi.com</string>
                <key>request_headers</key>
                <dict>
                    <key>User-Agent</key>
                    <string>Mozilla/5.0 (Macintosh; Intel Mac OS X 10_10_0) AppleWebKit/600.5.17 (KHTML, like Gecko) Version/8.0.5 Safari/600.5.17</string>
                </dict>
                <key>re_pattern</key>
                <string>https://downloads.vivaldi\.com/stable/Vivaldi[0-9TP_.]+\.dmg</string>
                <!-- Example: "http://vivaldi.com/download/Vivaldi_TP_1.0.83.38.dmg" -->
                <key>result_output_var_name</key>
                <string>match</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>URLDownloader</string>
            <key>Arguments</key>
            <dict>
                <key>url</key>
                <string>%match%</string>
                <key>filename</key>
                <string>Vivaldi.dmg</string>
            </dict>
        </dict>
        <dict>
            <key>Processor</key>
            <string>EndOfCheckPhase</string>
        </dict>
    </array>
</dict>
</plist>
